ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cyhal_spi.c
/***************************************************************************//**
* \file cyhal_spi.c
*
* \brief
* Provides a high level interface for interacting with the Cypress PWM. This is
* a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <stdlib.h>
#include <string.h>
#include "cyhal_implementation.h"

#ifdef CY_IP_MXSCB

#define SPI_DEFAULT_SPEED               100000
#define NUM_SPI_PORTS                   8
#define SPI_DEFAULT_IRQ_PRIORITY        7

#define SPI_OVERSAMPLE_MIN              4
#define SPI_OVERSAMPLE_MAX              16

#define FRAC_DVDR_MAX_VAL               32

#define SPI_SLAVE_FREQ_MUL              8
/* Default timeout in milliseconds */
#define SPI_DEFAULT_TIMEOUT             1000

#define PENDING_NONE                    0
#define PENDING_RX                      1
#define PENDING_TX                      2
#define PENDING_TX_RX                   3

/* Default SPI configuration */
static const cy_stc_scb_spi_config_t default_spi_config = {
    .spiMode                  = CY_SCB_SPI_MASTER,
    .subMode                  = CY_SCB_SPI_MOTOROLA,
    .sclkMode                 = CY_SCB_SPI_CPHA0_CPOL0,
    .oversample               = SPI_OVERSAMPLE_MIN,
    .rxDataWidth              = 8,
    .txDataWidth              = 8,
    .enableMsbFirst           = true,
    .enableFreeRunSclk        = false,
    .enableInputFilter        = false,
    .enableMisoLateSample     = true,
    .enableTransferSeperation = false,
    .enableWakeFromSleep      = false,
    .ssPolarity               = CY_SCB_SPI_ACTIVE_LOW,
    .rxFifoTriggerLevel       = 0,
    .rxFifoIntEnableMask      = 0,
    .txFifoTriggerLevel       = 0,
    .txFifoIntEnableMask      = 0,
    .masterSlaveIntEnableMask = 0
};

static cyhal_spi_irq_event_t cyhal_convert_interrupt_cause(uint32_t pdl_cause);

static cyhal_spi_t *cyhal_spi_config_structs[CY_IP_MXSCB_INSTANCES];
static cyhal_spi_irq_handler_t cyhal_spi_user_callbacks[CY_IP_MXSCB_INSTANCES];
static void *cyhal_spi_callback_args[CY_IP_MXSCB_INSTANCES];

static void cyhal_spi_0_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_1_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_2_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_3_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_4_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_5_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_6_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_7_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_8_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_9_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_10_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_11_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_12_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_13_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_14_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_15_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_16_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_17_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_18_cb_wrapper(uint32_t event) __attribute__((unused));
static void cyhal_spi_19_cb_wrapper(uint32_t event) __attribute__((unused));

static void cyhal_spi_0_irq_handler(void) __attribute__((unused));
static void cyhal_spi_1_irq_handler(void) __attribute__((unused));
static void cyhal_spi_2_irq_handler(void) __attribute__((unused));
static void cyhal_spi_3_irq_handler(void) __attribute__((unused));
static void cyhal_spi_4_irq_handler(void) __attribute__((unused));
static void cyhal_spi_5_irq_handler(void) __attribute__((unused));
static void cyhal_spi_6_irq_handler(void) __attribute__((unused));
static void cyhal_spi_7_irq_handler(void) __attribute__((unused));
static void cyhal_spi_8_irq_handler(void) __attribute__((unused));
static void cyhal_spi_9_irq_handler(void) __attribute__((unused));
static void cyhal_spi_10_irq_handler(void) __attribute__((unused));
static void cyhal_spi_11_irq_handler(void) __attribute__((unused));
static void cyhal_spi_12_irq_handler(void) __attribute__((unused));
static void cyhal_spi_13_irq_handler(void) __attribute__((unused));
static void cyhal_spi_14_irq_handler(void) __attribute__((unused));
static void cyhal_spi_15_irq_handler(void) __attribute__((unused));
static void cyhal_spi_16_irq_handler(void) __attribute__((unused));
static void cyhal_spi_17_irq_handler(void) __attribute__((unused));
static void cyhal_spi_18_irq_handler(void) __attribute__((unused));
static void cyhal_spi_19_irq_handler(void) __attribute__((unused));

static cy_rslt_t cyhal_int_spi_frequency(cyhal_spi_t *obj, uint32_t hz, uint8_t *ovr_smpl_val);
static void cyhal_set_ssel(cyhal_spi_t *obj);
static void cyhal_reset_ssel(cyhal_spi_t *obj);

static cyhal_spi_irq_event_t cyhal_convert_interrupt_cause(uint32_t pdl_cause)
{
    cyhal_spi_irq_event_t cause;
    switch (pdl_cause)
    {
        case CY_SCB_SPI_TRANSFER_IN_FIFO_EVENT:
            cause = CYHAL_SPI_IRQ_DATA_IN_FIFO;
            break;
        case CY_SCB_SPI_TRANSFER_CMPLT_EVENT:
            cause = CYHAL_SPI_IRQ_DONE;
            break;
        case CY_SCB_SPI_TRANSFER_ERR_EVENT:
            cause = CYHAL_SPI_IRQ_ERROR;
            break;
        default:
            cause = CYHAL_SPI_IRQ_ERROR;
            break;
    }
    return cause;
}
static __INLINE  void cyhal_spi_cb_wrapper_indexed(uint32_t event, uint8_t idx)
{
    cyhal_spi_irq_event_t anded_events = (cyhal_spi_irq_event_t)(cyhal_spi_config_structs[idx]->irq_cause & (uint32_t)cyhal_convert_interrupt_cause(event));
    if (anded_events)
    {
        cyhal_spi_user_callbacks[idx](cyhal_spi_callback_args[idx], anded_events);
    }
}
static void cyhal_spi_0_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 0);
}
static void cyhal_spi_1_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 1);
}
static void cyhal_spi_2_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 2);
}
static void cyhal_spi_3_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 3);
}
static void cyhal_spi_4_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 4);
}
static void cyhal_spi_5_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 5);
}
static void cyhal_spi_6_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 6);
}
static void cyhal_spi_7_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 7);
}
static void cyhal_spi_8_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 8);
}
static void cyhal_spi_9_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 9);
}
static void cyhal_spi_10_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 10);
}
static void cyhal_spi_11_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 11);
}
static void cyhal_spi_12_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 12);
}
static void cyhal_spi_13_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 13);
}
static void cyhal_spi_14_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 14);
}
static void cyhal_spi_15_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 15);
}
static void cyhal_spi_16_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 16);
}
static void cyhal_spi_17_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 17);
}
static void cyhal_spi_18_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 18);
}
static void cyhal_spi_19_cb_wrapper(uint32_t event)
{
    cyhal_spi_cb_wrapper_indexed(event, 19);
}

static void (*cyhal_spi_cb_wrapper_table[CY_IP_MXSCB_INSTANCES])(uint32_t event) =
{
#if (CY_IP_MXSCB_INSTANCES > 0)
    cyhal_spi_0_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 1)
    cyhal_spi_1_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 2)
    cyhal_spi_2_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 3)
    cyhal_spi_3_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 4)
    cyhal_spi_4_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 5)
    cyhal_spi_5_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 6)
    cyhal_spi_6_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 7)
    cyhal_spi_7_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 8)
    cyhal_spi_8_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 9)
    cyhal_spi_9_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 10)
    cyhal_spi_10_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 11)
    cyhal_spi_11_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 12)
    cyhal_spi_12_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 13)
    cyhal_spi_13_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 14)
    cyhal_spi_14_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 15)
    cyhal_spi_15_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 16)
    cyhal_spi_16_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 17)
    cyhal_spi_17_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 18)
    cyhal_spi_18_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 19)
    cyhal_spi_19_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 20)
    #error "Unhandled scb count"
#endif
};

static void cyhal_spi_interrupts_dispatcher_IRQHandler(uint32_t spi_num)
{
    cyhal_spi_t *obj = cyhal_spi_config_structs[spi_num];
    void *buf;

    if (NULL == obj)
    {
        return;
    }

    Cy_SCB_SPI_Interrupt(obj->base, &(obj->context));

    if (!obj->is_async)
    {
        return;
    }

    if (0 == (Cy_SCB_SPI_GetTransferStatus(obj->base,  &obj->context) & CY_SCB_SPI_TRANSFER_ACTIVE))
    {
       if (obj->tx_buffer)
       {
           /* Start TX Transfer */
           obj->pending = PENDING_TX;
           buf = obj->tx_buffer;
           obj->tx_buffer = NULL;

           Cy_SCB_SPI_Transfer(obj->base, buf, NULL, obj->tx_buffer_size, &obj->context);
       } else if (obj->rx_buffer)
       {
           /* Start RX Transfer */
           obj->pending = PENDING_RX;
           buf = obj->rx_buffer;
           obj->rx_buffer = NULL;

           Cy_SCB_SPI_Transfer(obj->base, NULL, buf, obj->rx_buffer_size, &obj->context);
       } else
       {
           /* Finish Async Transfer */
           obj->pending = PENDING_NONE;
           obj->is_async = false;
           cyhal_reset_ssel(obj);
       }
    }
}
static void cyhal_spi_0_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(0);
}
static void cyhal_spi_1_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(1);
}
static void cyhal_spi_2_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(2);
}
static void cyhal_spi_3_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(3);
}
static void cyhal_spi_4_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(4);
}
static void cyhal_spi_5_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(5);
}
static void cyhal_spi_6_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(6);
}
static void cyhal_spi_7_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(7);
}
static void cyhal_spi_8_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(8);
}
static void cyhal_spi_9_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(9);
}
static void cyhal_spi_10_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(10);
}
static void cyhal_spi_11_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(11);
}
static void cyhal_spi_12_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(12);
}
static void cyhal_spi_13_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(13);
}
static void cyhal_spi_14_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(14);
}
static void cyhal_spi_15_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(15);
}
static void cyhal_spi_16_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(16);
}
static void cyhal_spi_17_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(17);
}
static void cyhal_spi_18_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(18);
}
static void cyhal_spi_19_irq_handler(void)
{
    cyhal_spi_interrupts_dispatcher_IRQHandler(19);
}
static void (*cyhal_spi_interrupts_dispatcher_table[CY_IP_MXSCB_INSTANCES])(void) =
{
#if (CY_IP_MXSCB_INSTANCES > 0)
    cyhal_spi_0_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 1)
    cyhal_spi_1_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 2)
    cyhal_spi_2_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 3)
    cyhal_spi_3_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 4)
    cyhal_spi_4_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 5)
    cyhal_spi_5_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 6)
    cyhal_spi_6_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 7)
    cyhal_spi_7_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 8)
    cyhal_spi_8_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 9)
    cyhal_spi_9_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 10)
    cyhal_spi_10_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 11)
    cyhal_spi_11_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 12)
    cyhal_spi_12_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 13)
    cyhal_spi_13_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 14)
    cyhal_spi_14_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 15)
    cyhal_spi_15_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 16)
    cyhal_spi_16_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 17)
    cyhal_spi_17_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 18)
    cyhal_spi_18_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 19)
    cyhal_spi_19_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 20)
    #error "Unhandled scb count"
#endif
};

static void cyhal_spi_install_irq(cyhal_spi_t *obj)
{
    uint8_t idx = obj->resource.block_num;
    // default interrupt priority of SPI_DEFAULT_IRQ_PRIORITY (lowest possible priority).
    cy_stc_sysint_t irqCfg = {CY_SCB_IRQ_N[idx], SPI_DEFAULT_IRQ_PRIORITY};

